package org.example.chapter05.task11;

public class Task11 {
//    Критерий	             Objects.requireNonNull(obj)	                          assert obj != null
//    Когда работает	     Всегда	                                                  Только при -ea
//    Что бросает	         NullPointerException	                                  AssertionError
//    Назначение	         Проверка контракта (параметры, возвращаемые значения)	  Проверка внутренних допущений
//    Кто видит	             Пользователь API	                                      Только разработчик при тестировании
//    Можно ли отключить	 Нет	                                                  Да (по умолчанию отключено)

//    Objects.requireNonNull() — для публичного API
//    assert — для внутренних допущений

    // Где применять, примеры:
// Контракт: null-аккаунты недопустимы — это ошибка пользователя

// Внутреннее допущение: баланс не может стать отрицательным
// (гарантировано логикой выше, но проверяем при отладке)

}
